"use strict";

// ============== splice ===================

// arr.splice(start[, deleteCount, elem1, ..., elemN])

// ---------- Начнём с удаления: ----------------

let arr1 = ["Я", "изучаю", "JavaScript"];

arr1.splice(1, 1); // начиная с индекса 1, удалить 1 элемент

console.log(arr1); // осталось ["Я", "JavaScript"]

// ---------- Замена --------------

let arr2 = ["Я", "изучаю", "JavaScript", "прямо", "сейчас"];

// удалить 3 первых элемента и заменить их другими
let removed = arr2.splice(0, 3, "Давай", "танцевать");

console.log("removed:", removed); // splice возвращает массив из удалённых элементов ['Я', 'изучаю', 'JavaScript']

console.log(arr2); // теперь ["Давай", "танцевать", "прямо", "сейчас"]

// ------------ Вставка --------------

let arr3 = ["Я", "изучаю", "JavaScript"];

// с индекса 2 удалить 0 элементов
// вставить "сложный", "язык"
arr3.splice(2, 0, "сложный", "язык");

console.log(arr3); // "Я", "изучаю", "сложный", "язык", "JavaScript"

// -----------------

let arr4 = [1, 2, 5];

// начиная с индекса -1 (перед последним элементом)
// удалить 0 элементов,
// затем вставить числа 3 и 4
arr4.splice(-1, 0, 3, 4);

console.log(arr4); // 1,2,3,4,5

// ================ slice ================

// возвращает новый массив, в который копирует все элементы с индекса start до end (не включая end).
// start и end могут быть отрицательными, в этом случае отсчёт позиции будет вестись с конца массива.

let arr5 = ["t", "e", "s", "t", "i", "n", "g"];

let newArr = arr5.slice(2); // ['s', 't', 'i', 'n', 'g']
let newArr_2 = arr5.slice(2, 5); // ['s', 't', 'i']
let newArr_3 = arr5.slice(2, -1); // ['s', 't', 'i', 'n']

console.log("newArr=", newArr_3);

let copyArr = arr5.slice();
console.log(copyArr == arr5);

// ============== concat ===================
let arr6 = [1, 2];
console.log(arr6.concat([3, 4], [5, 6], 7, 8)); // [1, 2, 3, 4, 5, 6, 7, 8]
